---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginHoriz
source: html/eedcede8-7d26-c03f-115a-9983a949318c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginHoriz Property

"Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridOriginHoriz { get; }
```